%%
%加*为了解内容
%生成矩阵
    %直接法(通过分号进行分割行，逗号分割列)
        a = [1,2,3;4,5,6;7,8,9];
    %冒号一维矩阵 a = 开始 : 步长 : 结束，(步长为1可省略)
        b = 1:1:10;% 1,2,3……10
        b = 1:10;%与上一个等价
    %函数生成
        %linspace(开始，结束，元素个数），等差生成指定元素数的一维矩阵，省略个数则生成100个
            c = linspace(0,10,5);
            %公差 d = (末项 - 首项)/(项数 n -1 )
        %特殊矩阵
            e = eye(4); %eye(维数)单位阵
            z = zeros(1,4); %zeros(行列数)零矩阵
            o = ones(4,1); %ones(行列数)全1阵
            r = rand(4); %rand(维数)0~1分布随机矩阵
            rn = randn(4); %randn(维数)0均值Gaussian(正态)分布随机阵
            %维数处单写一个数表示行列数相同
%%
% 矩阵运算
    diag_a = diag(a,1); %diag(矩阵，k)用列向量生成矩阵主对角线上方第k条斜线
    diag_b = diag(b,1); %diag(行向量，主对角线上方第k条斜线)用行向量生成对角阵(除了改斜线外全为0)
    
    tril_a = tril(a,1); %tril(矩阵，主对角线上方第k条斜线)生成矩阵的下三角阵(该斜线上方全为0)，triu上三角阵
    % 加、减、乘、乘方
        a*a;%(矩阵运算)
    % 点运算
        % a.*b , a./b , a.\b , a.^b对应
        a.*a
        %/：右除。a/b表示矩阵a乘以矩阵b的逆
        %\：左除。a\b表示矩阵a的逆乘以b。
        %./：右除。a./b表示矩阵a中的每个元素除以矩阵b的对应的元素。
        %.\：左除。a.\b表示矩阵b中的每个元素除以矩阵a的对应的元素。
        
    % 逆矩阵
        pinv(a) %伪逆矩阵，当a不是方阵，求广义逆矩阵；当a是可逆方阵，结果与逆矩阵相同
    % 特征值和特征向量
        [v,D] = eig(a); % 输出v为特征向量，D为特征值对角阵
    % *行列式
        det(a)
    % *秩
        rank(a)
    % *伴随
        compan(b)

%%
% 矩阵的修改
    % 部分替换
        chg_a = a;%(做个备份)
        chg_a(2,3) = 4;%(行，列)元素替换
        chg_a(1,:) = [2,2,2];%(行,:)替换行
        chg_a(:,1) = [2,2,2];%(:,列)替换列，[]则删除该列
    % 转置
        T_a = a';
    % 指定维数拼接
        c1_a = cat(1,a,a);%垂直拼接
        c2_a = cat(2,a,a);%水平拼接
    % *变维
        rs_a = reshape(a,1,9);%元素个数不变，矩阵变为m*n

%%
% 信息获取
    % 矩阵行列数
        [row_a,col_a] = size(a); %[行数,列数]
    % 行列中最大的
        len_a = length(a);

%%
% 多维数组
    % 创建
        % 直接法
            mul_1(:,:,1) = [1,2,3;2,3,4];
            mul_1(:,:,2) = [3,4,5;4,5,6];
        % 拓展法
            mul_2 = [1,2,3;2,3,4];
            mul_2(:,:,2) = [3,4,5;4,5,6];%若不赋值第一页，则第一页全为0
        % cat法
            mul_31 = [1,2,3;2,3,4];
            mul_32 = [3,4,5;4,5,6];
            mul_3 = cat(3,mul_31,mul_32);%把a1a2按"3"维连接
            
%%
% *字符串
    str0 = 'hello world';%(单双均可)

%%
%转换
    % ___2___ --> 如num2str，将数字转字符串;dec2hex,将十进制转换为十六进制
    str_b = num2str(b);
    % abs,double取ASCII码；char把ASCII码转字符串
    abs_str = abs('aAaA');
    
            